[
    {
        "Title": "My (26f) bf (30m) got me Pokémon for Christmas and I can’t let it go, do I call it quits or work it out?",
        "Body": "For context, my boyfriend and I have been together for 3 years. Since I’ve known him he has always loved Pokémon. Personally, I have no interest but as his partner I encourage his hobbies and support him. This past Christmas we had a few brief conversations about Christmas budgets and have mentioned to each other things we have been wanting. I knew Pokémon packs were on the top of HIS list so I made sure to get him some. I mentioned wanting a few beauty products and a specific hoodie. Well Christmas comes around and to my surprise I open my gifts, the first one was a pack of Pokémon cards, okay whatever, the next one was a booster box of Pokémon cards. I stop and ask him if he’s joking, because this must be a joke right? Welp he smirks and tells me to keep going, I open my next gift, it was ANOTHER booster box of Pokemon cards. He was full of excitement while I open “my” gifts. That’s it those were my three gifts. I AM NOT AND NEVER HAVE BEEN INTERESTED IN POKÉMON. After this I told him I needed a moment to myself. I went to our bedroom and took a moment to gather my thoughts and lower my temper. When I came back to the living room there he was on the floor, both booster packs and the pack of cards he got “me” were opened and sprawled across the floor. I was in shock, not only did he get me gifts that I didn’t want, but he actually got them for himself and tried to play it off. I have been trying to move past this as I did not want to seem ungrateful but I just can’t believe he would do something like this. Every time I have tried to bring it up, he has told me how expensive those booster boxes were and how I made him feel bad for not appreciating my gifts. Am I being ungrateful or is he just a jerk?"
    },
    {
        "Title": "I 26 M lost the trust of my fiance 25 F after she confessed something really shocking to me in bed. How do I move forward from this? ",
        "Body": "So, it's the morning hours where I'm from, woke up to some quality time(sex)with my fiance before we start our day. After everything we had come to an end we laid down cuddling and one thing lead to another and was telling me something along the lines of if I ever left her she would make sure the other woman had to work really hard to keep me (something along the lines of breaking my manhood) which was unusual and funny but I guess when the sex is that you tend to get a little crazy, so I don't know how the conversation came up but she then said i have a confession to make and I'm just like OKAY while I held a smile on my face, that's when she said and I quote we had a fight(non physical) it was to the point that I was so frustrated that when I when to make you dinner I snuck something into your tea that makes you sleep and I was watching you fight that sleep, your eyes were so red and when you did actually went to sleep I sat down and watch you as I contemplate what to do about us and so many thoughts were going my mind while I watch you slept for like a few hours and I eventually got tired and just went to bed. End quote. The fear in my eyes were real as I just listen to my fiance admitted to being a fking Psychopath and to drugging me while she contemplated on a way forward.I know for a fact I don't trust this woman anymore and now I'm even more scared to sleep with her  or to eat from her all because we had an argument over her not doing what's right. We haven't spoken for the entire day after that confession even after she's made several attempts to talk. I'm afraid to even go to my friends knowing they'll just laugh and say it's probably nothing bro and tell me to relax. "
    },
    {
        "Title": "My (33F) husband (34F)'s pregnant mistress (28F) begged me to leave him and I refused. Where do I go from here?",
        "Body": "Google sent me here because I need to let this out.I don't even know what she qualifies as, if mistress is fitting or not. It was a drunken one-night mistake- my husband's words. They run in the same work circles and field but don't work together. My husband was dropped off at our house 2 months ago drunk off his ass after a company event. He was crying and out of it, blabbering about nonsensical things. I tried sobering him up, but his legs couldn't even support him, and I couldn't drag him to the couch, so he slept it off on the ground and the next day he confessed to everything.He was crying and I've only seen him cry a handful of times in all our years of marriage and he said that everything was foggy, and he doesn't remember much but that he slept with her. I won't type in my reaction because I can only describe it as violent. Not physically but I unloaded on him and sobbed and screamed and then lied to our kids after it woke them up.We tested him for drugs because what he was describing (foggy memory/didn't drink that much etc) was assault and as awful as it is, I felt a little bit of relief that it might have been and that he hadn't willingly cheated on me but there was no trace of drugs in his system.The past 2 months have been brutal on us but we're slowly working on us in therapy. Some may call it weak that I didn't divorce him, but I just can't bring myself to do it and believe me I thought about it a lot. He hadn't had contact with her since that night up until she got his number and sent him a picture of her bloodwork a few days ago- She's pregnant and is asking him to meet up. That sent us into another spiral, but we agreed that I would meet her because there's an innocent life on the line.I wish I can say she's awful and I hate myself for this but under different circumstances, her and I would've been good friends. She seemed ashamed and honestly looked lost. She's not that much younger than my husband and I, we're 33 and 34 and she's 28 but grew up sheltered by her religious parents, not that it's an excuse but from what she said. I asked her what she was going to do with the baby and she got quiet. I don't know what I thought she was going to say but it certainly wasn't her asking me to leave him. She said that once her bf finds out he'll leave her and her parents will cut her off for having a 'bastard' baby and that she can't do it on her own and that I'll get a nice settlement and start fresh. I laughed. God help me but I laughed harder than I thought I could while she started crying. These past 2 months have been testing my sanity, and I don't have that much left in me. Once I calmed down I told her that I will not leave him. If she wants to have the baby, we'll figure out support and custody but that was about it.She started crying harder in the middle of the cafe but hell, we were already getting looks from my unhinged laughing and begged me to leave him. I told her I won't. My husband and I have been together since I was 14 and he was 15. We stuck together through highschool, got engaged and married throughout our BAs and Masters, have 2 beautiful kids and were trying for more and I won't throw that all away just because she spread her legs and he fucked her once. He's all I've ever known, I don't fucking remember a life without him in it. And let's say I agreed to leave him then what? He'll marry her and she'll take over my life and be in my kids lives raising them half of the time? I didn't let her get a word in and I was crying by the time I was done with my rant, and I left her there, she sobbing too.My husband and I already talked with a lawyer for a paternity test and we're waiting on that before we do anything else. My husband sent her a text with my contact information and told her all communications are to be through me before he blocked her number. I didn't ask him to do that but he's trying. I just don't know where to go from here if it does turn out to be his."
    },
    {
        "Title": "UPDATE: The guy (22M) that I (21F) am dating is learning ASL for my brother, but my friends think it's creepy. How do I proceed with this? ",
        "Body": "Sorry, this is gonna be a long one. This will be an update to my [original post](https://www.reddit.com/r/relationship_advice/comments/1hbrhz2/the_guy_22m_that_i_21f_am_dating_is_learning_asl/), but I'll also try to address some of the frequently asked questions.TLDR of my original post: I've been dating a guy (Jon, 22M) for 5 months. This is my first relationship. He met my family 2 months ago and had befriended my brother (Trev, 19M), who is deaf. The two of them have been gaming with each other ever since. The guy I've been dating has apparently been learning ASL to communicate with my brother better. However, my friends said that his behavior could be seen as obsessive, emotionally manipulative, and downright creepy.First off, I wanted to thank everyone who gave their insights in my original post. As I said, I'm very new to relationships, so reading insights other than my inner circle's was very eye-opening.To begin, many Redditors said that my high school friends are conniving, untrustworthy, and ableist people who never bothered learning ASL despite knowing me for a long time. I take accountability for this. I'm not saying they're blameless, but it's not entirely their fault. For some context, our family moved to our area when I was in senior year of high school due to my dad's job. The friend group (2 guys + 2 girls before I joined) was already tight when I came in. They then took me in after we got grouped together for a school project, and they've been with me since (we've been friends for about 4 years now). They're not exactly saints, but they helped me survive my senior year in one piece. They are fun to hang out with, and they were the support I needed when I was struggling.Also, during that time, my brother was having an especially hard time adjusting because of his disability, so my friends never really saw Trev a lot. To be clear, I was never ashamed of Trev. It's just that whenever my friends came over, he either locked himself in his room or was in a different area with his tutor and never really interacted with us. Whenever he does come out, he's really shy and awkward, so my friends mostly just get glimpses of him. By the time Trev became more comfortable in our area and found his own circle, my friends and I had already graduated from high school and don't really hang out regularly anymore. They're friendly and polite with Trev, but then again, they never interacted as much to the point of them actually needing to learn ASL for him.Now, for the update.Last week, my friend group had our year-ender party and I decided to bring Jon along to meet the rest of my friends. My other friend in the group also brought his girlfriend, so this wasn't really weird (others have done so in the past as well). I've commented in the previous post that Jon had only met my closest guy friend (I'll call him Mike, 21M), so I wanted the rest of them to form their own opinions of Jon after they've met him.Initially, there was some tension and awkwardness from my friend group toward Jon. They were a bit cold, and they were throwing some harsh remarks toward him. Eventually though, they all warmed up to him, and they were actually pleasantly surprised by his personality. We all got along well, and we all even had fun in our games. However, I could tell that there was still awkward tension coming from Mike toward Jon and the rest of our group. He was throwing meaner jokes more than usual and he's kind of isolating himself from the activities.The day after the party, I had lunch with my closest girl friend (Sophie, 21F) to clear the air because I could tell that they could also sense something was off.A lot of Redditors speculated that Mike had a crush on me and was jealous of my relationship with Jon. Turns out, you're all 10000% correct, but it's a lot more complicated than that. Apparently, Mike has had a crush on me since our senior year high school. However, he's known in our school as a notorious ladies' man and had a new girl with him almost every month. This got exponentially worse during college. He had different hookups almost every night, and he even had a pregnancy scare with a girl last year. I knew about all of this because he bragged about sleeping around every time we meet up.What I didn't know was that the entire time, Mike has been making up fake stories about me and him. Sophie told me that apparently, Mike and I had a pact that if we were still both single when we're 30, we'd marry each other. Also, he told our friend group that we hooked up after graduation and that he took my virginity then, so he's \"my special person\" (whatever that means). He also told them that we'd been secretly hooking up consistently throughout college (for context, Mike and I go to different universities that are just about 30 minutes apart). Lastly, Mike told them that I said I'm in love with him. He told our friends not to tell me anything so I don't get embarrassed or upset since I have this image of being somewhat of a prude.Mike also told our friend group that when he met Jon, he thought that Jon is a total jerk who has been manipulating me and taking advantage of my innocence and naivete. He said that Jon had been forcing himself into my family and is driving a wedge between me and my friends. Mike also said that after he had lunch with me and Jon, he tried to convince me to stay away from Jon because he's not a good influence on me, but Jon had effectively brainwashed me. This explains why my friend group was already so antagonistic toward Jon when I told them about him.For the record, none of what Mike said was true. There was no pact, we never hooked up, and I have NEVER been in love with him.After that, Sophie and I asked the rest of our friend group (except Mike) to jump on a FaceTime call with us. They all shared different versions of what Mike told them (there were a lot more), but I disputed everything. We were all collectively shocked about everything that we learned that day. They apologized for their behavior toward me and Jon, and I told them I understood given all the lies fed to them by Mike. Then, everyone agreed to kick Mike off the friend group. Sophie suggested that maybe we could have an intervention for Mike first, but I just said that I didn't want anything to do with him anymore. The rest of the group agreed, so we're essentially cutting him off. Sophie said she would still talk to him just to inform him of everything that happened, but I really just wanted to distance myself from him.Now, it's been a week of being Mike-free. Sophie said that when she and our other guy friend talked to Mike, he became extremely defensive, confrontational, and aggressive. He wasn't physically violent, but he called them names, attacked their characters, and made such awful statements about everyone in our friend group that I won't include here anymore. It looks like cutting him off completely was the right call.Now, for some more uplifting updates.After reading everyone's comments in my previous post (there were a lot!), I reflected on my relationship with Jon and my friends. I then talked to my parents for advice, since they have the best relationship I know of. They told me that from what they saw of Jon when he visited our home and how I spoke of him, it seems like he is a legitimately nice person with pure intentions. It also helps that Jon and I have been friends for months before we started dating, so I already knew his character even when there was less pretense of him trying to impress me (he's already impressive on his own though lol).I then told Jon about everything that happened and apologized, fully expecting him to be mad at me for doubting him and his intentions. Instead, he said he understood, because of course it was just natural for me to trust my friends and expect them to have my best interests. He then asked me if there was any point in our relationship when he I felt uncomfortable or uneasy around him, and I categorically said no. I told him that he's my safe space, and he has nothing to worry about. He then reassured me that his intentions with me are genuine, and he even said that he sees a future with me, which I reciprocated.Also, Jon and Trev's friendship is still going strong. Trev has participated in one of Jon's D&D sessions with his friends, and Jon and I both acted as the translators. We were delighted to see that most of Jon's friends already know ASL alphabet! Apparently, they had even included it in the lore of their D&D campaign. Also, Trev had been asking Jon some tips for working out and getting fit lately since they have the same body type but Jon is more toned (one of his brothers is a fitness instructor).Also, I met Jon's family for the first time for their annual get-together. It was super fun! There were games and contests. Also, I wasn't prepared for it but apparently, since their mom is a theater performer and their dad is a music producer, it was their family tradition to have a talent showcase. They gave me a pass this time, but they told me I should prepare something impressive for next year lol Jon and his brothers performed Bye Bye Bye by NSYNC (in full Deadpool, Wolverine, and Captain America costumes), while his sisters and their husbands did Defying Gravity from Wicked. Their parents did a medley from the Sound of Music. It was a total blast! I felt their family's warm welcome, and they really treated me as one of their own. I could see where Jon got his good values and looks from (though I think I need to start taking voice and dance lessons to keep up with them lol)So, that's it for this update. My relationship with Jon is stronger than ever, and I finally know who my true friends are! If you've made it this far, thank you so much for your time! Happy New Year to us all!TL;DR - My male best friend has a crush on me and has been making up stories and feeding lies to our other friends, tarnishing the image of my boyfriend. I have cleared things out with my other friends, and we've cut off our toxic friend from our friend group. My relationship with my boyfriend is now stronger than ever.EDIT:Just had lunch with the rest of my friend group. We all compared notes about Mike's lies. Apparently, he concocted extreme fantasies about every one of us. He has been stirring unnecessary drama for years, and even caused the breakup of one of our other friends with her then-boyfriend. Mike also told them that apparently, I threatened to cut ties with our friend group if any of my \"secrets\" come out, which was why no one really confirmed anything with me. He also said I was having mental health issues because of it, but Mike said he's helping me out, so there was no need for them to be concerned. Through the years, I could recall Sophie and our other friends checking up on me and making sure I'm okay without really referencing any of what Mike said. Some of their statements didn't really make sense to me at the time, but I just chalked it off to college stress. Our other guy friend also made remarks about me and Mike, but again, I chalked it off to friendly teasing. Now, everything is clear to everyone, and we're all ready to move on from this. There's still a lot of processing to do, but at least we now know the truth."
    },
    {
        "Title": "My husband (40m) is mad at me (f38) because I wanted to use the living room after family left for Christmas. I feel like this is ridiculous? ",
        "Body": "So background here. I have stage 4 cancer. Diagnosed about a year and a half ago. My step daughter, 17 got her license a few months before I was diagnosed. As soon as she got her license and didn't need me to drive her anywhere she has decided I'm the worst person ever, because I asked her to clean up after herself when she was growing up. Part of this is she completely ignored me and acts like I'm not a person that lives in this house.  It's really great for my feelings when I'm literally afraid I'm dying of cancer daily. Keep in mind I practically raised her as a single gle mom and did EVERYTHING for this girl when she was growing up.  Took her to every single girl soccer practice and now I'm not wanted at her games kind of stuff. It's ridiculous and not fair. So after everyone left our house after Christmas brunch I wanted to chill in the living room and watch a movie. I didn't want to go nap in the room with my husband  because he naps for 20 minutes and then lays there on his phone tossing and turning and making all kinds of noise while I'm still trying to nap. Well apparently my step daughter wanted to use the living room as well. So now he is mad that I chose to take my space and use the living room that I pay half the rent for. And I wouldn't give it up for a 17 year old that walks around here treating me like absolute crap.We are now in a blow out fight. I'm being told I'm being petty. That I'm twisting things, that I'm playing a victim.  I literally just wanted to use the living room and im not sure why my step daughters wants are more important than mine."
    },
    {
        "Title": "My (23F) dad’s (59M) gf (25F) started “momming” me",
        "Body": "My (23F) dad’s (59M) girlfriend (25F) started “momming” me yesterday. We’re on a family trip and they just got back together after a 2 year separation (she just showed up to our family thanksgiving and I guess that meant they’re back together). They met when she was 18 and he introduced her to me and my siblings when she was 19 and I was 17. He lied and said she was 25 at the time but a little light googling I found she was 19. We’re like day 8/11 of our trip now and all of a sudden yesterday she’s started to treat me like a child and she’s tried making it apparent we’re different generations and it’s getting on my nerves. For example, she tried explaining what Vine is to me and that she wishes it was still around so that I could experience it too even though I did? Then today I was making jokes with my sister (19F) literally making fun of my own self and the girlfriend jumps in with a stern voice and says “girls. Stop it right now.” In a very stern like disciplinary voice because she mistakenly thought my sister made fun of me. That made my blood boil because even if we were fighting she has no business 1) jumping into the conversation to stop it 2) take on an authoritarian role. Later on, the girlfriend explained to my other sister (18F) how to turn on a normal shower and asked my sister if she needed help undressing and getting in the shower. My sister (18F) obviously felt very uncomfortable and was like hell no I’m not showering and getting undressed in front of you. She acts like an 18 year old girl is incompetent? FYI this girl is my dad’s sugar baby and is completely supported by my dad. She is extremely spoiled and entitled. Such as won’t drink anything less than Voss water and must have top tier designer clothes&jewelry on her at all times. My dad and his gf are really toxic for each other. They’ve broken up at least 20 times that I know of since I met her. (This is his type of woman now since my parents split 10 years ago. He likes young naive sugar babies but she’s the closest in age to me of all the gfs).Anyways, I’m looking for honestly small jabs or comments I can make to shut her tf up because I feel very uncomfortable with her momming me. Please don’t give any advice on communicating to my dad these issues. That will backlash on me and this girl is extremely emotionally immature, so if you have any smart Alec comments or lowkey jabs that would be helpful! TDLR: my (23F) dad’s (59M) very young girlfriend (25F) is starting to try and parent me. Asking for smart Alec comments to shut her up please. "
    },
    {
        "Title": "My(F19) biological mom is 35. My dad is M45. Words cannot express how I’m feeling.",
        "Body": "If you do the math, you’ll see that my bio mom was sixteen and my father was 26 when I was born. I never knew this. So I’m really disappointed at the moment. I never really knew my mom. She and my dad split when I was three & the memories I have of her are very distant. My dad remarried when I was six to my step-mom (F42) & together they had three more kids. In my household, it was no step or half, we were simply just family. Did I ever wonder about my bio-mom? Yes and no. I was raised in a tight-knit home, so I never felt like I was really missing something because my step-mom also raised me, but I sometimes wondered about the woman who I’m supposedly a carbon copy of.My dad RARELY talked about my mom. From what I knew, they got married when they found out she was pregnant, and she left I reached out first and we met up for the first time last week. I was so nervous. I felt like I made a mistake, but she explained to me her story. My mom was a troubled teen & she left home. She and dad met when my mom was fifteen, shortly after she ran away from home. He offered her a place to stay, and it wasn’t long before they started a relationship. She said that she was miserable at the time. She didn’t want a baby—me, she didn’t want to be married, and she realized she made a mistake. She said the marriage was so bad, and it was really unhealthy. So one day, at the same exact age I am right now, she left. She moved back home and restarted her life. I’m so angry. I’m so angry about so many things. I was groomed when I was fourteen by an adult & luckily my dad caught the situation fairly early before any serious damage could happen. The way my dad handled it was amazing…yet it turns out he is the same exact person I escaped. And also, I’m regretting meeting my mom. I keep dodging text messages, which isn’t fair as I’m the one who reached out out to her, but I’m regretting it. Why did I find it necessary to meet a person that didn’t go looking for me? It wasn’t what I thought it was going to be. I don’t know how to process this wave of emotions. How do I? The person that I usually go to for advice on things is my dad, but what can I do now that I can’t even go to him?I’ve been doing well, you know? I’ve been in therapy since my early teens, but as of 2 years ago I’ve been doing so well. Now, it feels like I’m in a rut. It feels like I’m mad at everyone and all the angry emotions are just piling on. How do I process everything?"
    },
    {
        "Title": "I M23 sustained an injury that will prevent me from having sex for a while my 22F girlfriend wants to open our relationship until I recover, is it time to end it?",
        "Body": "I (m23) have been with my girlfriend (22f) for 2 years. 2 weeks ago I tore my hamstring while deadlifting, the pain is severe and I have to use crutches to walk and even with the crutches it is still painful, according to the doctor the injury requires at least 4 months to heal, my girlfriend took care of me since I got injured.Before the injury we had an active sex life, that has to be postponed because the pain and the medications killed my sex drive, and even if I had a sex drive it would still be difficult and painful. I thought my girlfriend would be patient and understanding but she wasn't, a few days ago she came up to me and told me how frustrating it is to abstain for that long and it is unfair to keep her waiting, that her libido is high and sex is a \"need\" for her. She then asked for a one-sided open relationship until I recover, her justification is that it is only physical and she won't form any emotional bond with anybody.I was devastated when I heard that, just when I thought the pain couldn't get any worse, my partner of 2 years is watching me experience excruciating pain and instead of easing my pain she is adding to it, I rejected her idea and she was visibly frustrated, she tried to convince me again yesterday but I shut her down again.I don't know what to do I feel betrayed and I don't know if I should end the relationship"
    },
    {
        "Title": "I’ve (28F) been faking most orgasms with my husband (31M) for years and now it’s causing problems.",
        "Body": "I’ve (28F) been faking most orgasms with my husband (31M) and now it’s causing problems because I’m “selfish” for “finishing” first. For some context: my husband and I have been together for 7 years, married for 3. Since the beginning of our relationship, I’ve had the bad habit of faking orgasms during penetrative sex. At first, I thought it wasn’t a big deal, but as time went on, I felt stuck. I’ve never truly orgasmed from penetration alone. However, I orgasm regularly during masturbation or oral sex—often multiple times. For example, my husband usually stops oral after I cum three times, but I’ve even hit 14 during solo play. So, I know the issue isn’t my ability to orgasm.The problem started because he seemed to take pride in “making me cum” during sex. I didn’t want to ruin that for him—it made him feel accomplished and confident. Sometimes I faked it just to relieve the slight awkwardness of him trying hard to make it happen. Over time, I fell into a pattern: two “orgasms” during penetration, then he’d finish. It felt easier to keep up the act than to address it. Honestly, this routine has worked for years—he seemed happy, and I was okay with it. He’s reiterated several times how proud he is (in a humble brag, “aren’t you lucky to have me” kind of way) that he pleases me so much with penetration.But yesterday, everything changed. Out of nowhere, he implied that I’m “sexually selfish” because I focus on my pleasure instead of his during penetrative sex, cumming twice before he finishes. I was shocked—first, because I fake those orgasms for his benefit, and second, because I thought it made sense for me to “finish” first since sex is essentially over after he cums. He suggested I focus more on his pleasure instead of mine. He said that by me usually always finishing before him, it seems that I’m focusing more on my pleasure than his.His comment hurt. I’ve spent years faking orgasms to boost his confidence, and now he’s calling me selfish for it. I wanted to blurt out the truth, but I couldn’t. I feel like this is the final straw, though. I honestly don’t want to fake it anymore.Any advice on how to navigate this delicate situation?"
    },
    {
        "Title": "My fiancé (26M) kicked me (23F) four times in the chest. Why…?",
        "Body": "We've been together for 6 years, and we were planning to get married in 2025. For years, I did feel that he actually loved me. But few nights ago, he got angry at me but it wasn't the angriest he had ever been, I was trying to push him off while he was playing his games and I don't know what but something flipped and he kicked me hard in the chest four times even after I fell down to the floor. He never once asked me if I was okay that night. I know that it is not right to do that to someone else but why do people do that to someone they love? Like is putting your hands on your partner ever justifiable? I'm possibly still in denial, but what am I supposed to do now? I always heard about stories like these where their partners put their hands on them but I never once thought it would happen to me.. i know I should leave and I want to but it’s easier said than done.. I feel helpless because I don't have anyone to talk to about it.UPDATE!!!! Never would I ever imagine that the internet would be so kind to me. I wish I could reply back to everyone, but do know that I’ve read every single of it. You have no idea how much your words mean to me, to have complete strangers to care for my safety in such a genuine way. I’ve moved out and blocked him everywhere but he managed to apologise to me via email. He finally acknowledged what he did to me was wrong but not without placing half the blame on me. He mentioned that he snapped because of those times I’ve tried to leave him. I can’t lie that when I was reading the email, I almost fell for it but then I remembered the words from the thousands of strangers on Reddit, you gave me strength. As I’m typing this update, I’m at the hospital waiting for a scan. To clarify on why “I pushed him off”: he was playing video games and wanted BJ but I was not in the mood for it so I pushed him off (lightly, he was not physically hurt). If the roles were reversed, I would’ve never physically hurt someone even if they’re weaker than me. I am aware of the consequences of staying in an abusive relationship but when these fears become a reality, it takes awhile to fully accept it because I never once imagined it would happen to me. I knew him for 6 years but I guess I never really did.I’m so sorry to those who read this and have to be reminded of how it felt for them and to those who are currently experiencing similar situations like me, please get out <3"
    },
    {
        "Title": "How do I tell my wife (37F), who has BPD, that she is losing me (37M) and our 9 and 11 year old?",
        "Body": "The basic backstory is my wife has BPD,, anxiety and depression. Over the last 3 to 4 years she's gotten progressively worse. She's at the point where she can hardly hold a job, doesn't help with any household tasks, doesn't interact with our kids, and has no interests except smoking weed and chatting with dudes on snap because \"it makes her feel better\"Big kicker, last July, she offered my minor neice weed AND sent her a link to a NSFW kink test. CPS obviously got involved, police, etc. I was cleared instantly, she admitted to everything had zero repercussions. It's like it gave her free reign to do whatever she wants. I held my daughter Monday night while she cried to me about how she wished her mom cared about her as much as her mom cares about her friends. My son straight up said he'd rather spend his holiday break with his grandparents if she's just going to sleep and not hang out with him. They're hurting, we all are.When CPS came around, she took off, said she was moving back to west coast US. Her brother convinced her to turn around and come back here. I'd file for divorce, but I know she's sick, she goes to therapy (finally). I have a lawyer on retainer and papers have been ready since August to serve.So twofold. How do I approach her with all of this. She needs an ultimatum at minimum, but she'll just shut down. I've read the books and talked with therapists and everything we've tried to do to get a conversation going fails. It's beyond time she hears how badly her kids and I are hurting. Or do I skip that and just file? CPS already failed them once, even the police were amazed she was cleared after admitting everything, and since she was cleared all they could do was a counter ticket for the weed. I cannot get sole custody as a male in my state, my lawyer has said as much. I can just imagine the hell they'd have, even limited time with her. It's all screwed up. Anyone else ever been in something like this? Or have anything? I'm at wits end. EDIT for readability and clarity..................Update : Went to talk with her when she got home. I didn't just come attack her with accusations, but chatted for a few minutes. Then asked if we could have a conversation about the kiddos, and some things they'd told me about how they're feeling. I said one thing: \"They said theyre confused about what's going on, and don't feel loved like they used to.\" She shut down instantly. Sat in silence for a few minutes, told her I'd really like to talk because im worried about them and got hit with \"you're just mr perfect. I might as well just go back home. None of you need me, obviously. Just leave me alone.\" I'll be changing a few things on the papers tomorrow and have my lawyer file. "
    },
    {
        "Title": "My (19F) boyfriend (20M)’s eyes scare the CRAP out of me. I’m not sure what to do from here?",
        "Body": "Posting on my spam because my man’s on reddit. My boyfriend and I have been together for six months but have known and been friends with each other since we were 17 and 18. I mention this because it’s relevant, but he has NEVER EVER been abusive or manipulative either verbally, physically, or emotionally. Never ever a hint of any of that nonsense. We’re both very levelheaded people so no crazy fights with screaming or anything like that as we view that as disrespectful. There are some disagreements and stresses we have as we’re long distance and pursuing different paths in life at the moment, but we have a very healthy relationship.Now here’s the main issue and it’s kind of insane-sounding but idk. A couple of months ago we were having a civil disagreement about something, and he was glancing at me from the corner of his eye and speaking to me - and the look in his eyes genuinely scared the shit out of me. And it’s not about the eye color or anything like that. It’s the LOOK. You know how you hear about the “soulless” eyes that serial killers have?? Like no joke, that was 100% there. And I haven’t ever gotten that “something is wrong, you need to run” feeling before with anyone else’s. It obviously wasn’t anything intentional on his part and he was speaking very calmly but I immediately stopped disagreeing and just accepted whatever he was saying because i was so unnerved. I didn’t mention anything to him and just ignored it. But the next time we disagreed about something, the “look” was back and again i got so genuinely frightened i just agreed with whatever he was saying. This doesn’t happen every time we disagree or argue but it happens enough to make me question whether I’m safe with him. I know a lot of people say this on this app, but he’s actually an amazing partner to me and i’m so very happy with him. I’m just looking for advice on what to do next and how seriously I should consider this feeling. "
    },
    {
        "Title": "I (single 48F) woke up to this text this morning from my colleague (married 51M) and friend of 5 years",
        "Body": "I (single 48F) woke up to this text this morning from my colleague (married 51M) and friend of 5 years. I am so upset that he sent this to me. He said he’s pretty sure none of this would come as a shock to me. Um, YES IT DID!! I thought we were friends. We work in the same department and have to work together every single day. He’s married!! I, honest to God, thought our friendship has been nothing more than just that. Friends. I have asked myself if I’ve given any mixed singles and I swear I haven’t. When we went to BWW 5 years ago, it was after we had to meet a customer together and so we went to lunch. I don’t even remember what we talked about but I promise you, it was small talk. I remember this lunch specifically because we both got Covid afterwards. I treat him the same way I treat my other colleagues (many also friends). I have always felt comfortable and safe around him because he is married (for 20+ years). I was in a relationship 4 of the 5 years I have known him. I have NEVER looked at him in a romantic way and never will. I don’t understand why he would send this to me because it changes everything. I haven’t responded to him because I don’t know what to say. Btw, I go to lunch with him and other colleagues from time to time. We go as a group or sometimes 1 on 1. I think I’m upset because I really appreciated his friendship and now I’m wondering what he expected from me after sending this text. Does he think I would get involved with him romantically? Did he think I wanted to hear this? WTF? I have told him my stance on people cheating and how I do not condone that kind of behavior. Since we work together so closely (we are both upper management), how do I handle this? What do I say? Here is the text (since I can’t post screenshots to this forum):5 years.  For the past 5 years, since a day that we had a lunch at Buffalo Wild Wings, I have not been able to get you off my mind.  It was really bad about 2 years ago when I would have given up everything I had just to have dinner with you, but I find that recently, it is happening again.  To wake up in the middle of the night thinking about you is both confusing and exciting.  I'm pretty sure none of this will come as a  shock to you but I'm telling you because I have needed to get it off my chest for years now and I know I need to stop before it causes any issues at work. I'm always comfortable telling you anything and since I won't be seeing as much of you as in the past now that we are downstairs, I thought I would end the year by letting you know.  Your sense of humor, confidence, strength, independence, motivation, risk taking, etc. makes it hard for me to hold in telling you how beautiful I find you every time I see you.  Every day there is something different that has me realizing just how special you are.  I hope 2025 brings you the health and happiness that you deserve."
    },
    {
        "Title": "My partner (32M) broke up with me (29F) after 10 years together. Now he’s texting me with regret. ",
        "Body": "A few days ago, my boyfriend (32M) broke up with me (29F).  I’ll admit, I saw it coming and maybe felt the same way too based off how avoidant he can be. I kept my calm and he cried and told me that he doesn’t know how he feels anymore, that it hasn’t felt the same in a long time. I asked if it was anything I did, and he said “no, you’ve been an angel. You deserve someone better than me.” He explained that he cares about me but isn’t sure if he loves me the same way.  We had plans of getting engaged soon, as far as I know he was close to saving up the money for the ring I chose.A calm came completely over me, and I agreed and told him it’s for the best. He cried and hugged me and just kept apologizing. I didn’t want to show how hurt I was and just remained positive. I told him it’s alright. He said he’s going to continue to pay his portion of the rent for as long as I need. He’s coming in a few days to collect his things. He kissed me on the cheek and hugged me again (this happened in the parking lot outside his job, after his shift) and he was sobbing as I drove away. I saw his location remained in the parking lot for many hours, until 2 in the morning. Then he removed me from location, and I removed him. I feel like I was hit by a truck. I’m proud of myself though for not crying or begging. I removed the relationship status myself on social media. Today, only two days later, I receive this text “I just have regrets about the other night. You had thoughts and ideas, and instead of trying anything, I just kinda blew them off. I feel like I just gave up on ten years and that bothers me. The other night happened because I haven't been communicating my thoughts and feelings like I should have been, so for that I'm sorry.” Is this bread-crumbing, an attempt at reconciliation, or something else? I feel like I need to be prepared as he is most likely stopping by tomorrow to collect his things. TL;DR my ex (32M) broke up with me (29F) after ten years together. Now, two days later he’s messaged me saying he has regret. Do I interpret that as bread crumbing, wanting to reconcile, or something else? I need to be prepared for when he comes to collect his things, I don’t want to be blindsided. "
    },
    {
        "Title": "I accidentally saw a text on my (28M) girlfriend (29F) computer saying that she feels she’s out of my league. I feel like I have to break up with her?",
        "Body": "TLDR: Went to help gf with presentation, accidentally found a convo between her and her sister where my gf said she’s out of my league, unambitious, eat like shit, would never want kids with me even if we did want them (we don’t) and would resent me for making less money than herI’ve been with my girlfriend for around 3 years, everything has been pretty good overall. This happened a few weeks ago so I’ve had time to think on it. My girlfriend had an opportunity to go on a free sunset cruise (fancy dinner, drinks etc) with some coworkers but had a presentation due that night which needed a bit of work, so I said I’d do it so she could go. Turns out it needed a bit more work than I thought. I was on her macbook and I want to send it to myself to work on the desktop (windows) so I can be more comfortable. So I open messages, can’t find my name in the recent convos, and just type it in the search bar. When you do that on a Mac it turns out that it’ll show the contacts (if you search a name) and also show the most recent conversations where the search term (my name) was mentioned. Right before I click my name I notice a message from her sister that says “I like (op) a lot but I feel like you are very much out of his league and he should try harder to be a better man for you“, so I open it (may be shitty I know) to which my gf responded “I agree”. I read their convo, nothing more, and she went on to say that she thinks I’m unambitious, “eat like shit”, “will resent me for making less than her” and that she ”wouldn’t want kids with (me) even if she(gf) did want kids”. She said that I was the one thing keeping her happy though. This was said during a fight over her never being willing to visit me 1hr away and leaving me to do all the traveling, but then saying she was going to fly 6hrs one way to visit her male friend (only context given) for literally one day. She’d fly in at night, spend one day together, then fly back the following day. It turned into a fight because she was willing to fly 12hr round trip and spend hundreds of dollars on a flight (and we both have no money because we’re students so it’s a big deal) but wouldn’t travel 1hr away to visit me for an entire weekend. Just to clarify, she didn’t end up going because I thought it was suspicious, we got in a fight and during/after the fight the convo took place. I’d agree that she probably is out of my league, and she will almost definitely make more money than me, but we both will have doctoral degrees and I expect to make ~120-130k and she’ll probably make ~250-300k, so there is an income disparity but it’s not like I’m not making good money regardless. I don’t think I eat that bad, and I’m slim (low end of normal bmi) so I don’t think I’m completely out of touch there but definitely not eating salmon and steak every night. There was no mistreatment on either end. I try to do nice things with and for her within the means of my $0 student salary and her parents like me. I just think she doesn’t like me I almost feel dumb for asking but, I’d be a fool if I didn’t break up with her, right? Update: yeah we’re done. sorry it wasn’t the dramatic ending some may have been looking for, but I did bring up what I saw, she cried and said she didn’t mean it etc and that was about it. Thanks for the people reminding me I’m a catch because it seems like I forgot that for a bit ;) but I’ll probably wait a bit before dating again so I won’t be able to see how true that is for a lil while Small edits/clarification: she didn’t go on the 12hr round trip flights because I called her out, she cheated in the past but not on me (that I know of), and for people saying I’m “cooked” or things like that for waiting this long, I had very important tests to take so I didn’t want the additional drama until they were over so it’s not like I read it and was gonna let it slide"
    },
    {
        "Title": "My girlfriend (27f) is expecting her name on the deed to a house that I (28m) will be using my money to buy?",
        "Body": "I have been with my partner for over 3 years and we've said in the next 5 years it would be nice if we had enough for a deposit for a house. Last month I inherited a pretty substantial amount of money which will allow me to buy a house outright.I was talking about this with my partner and mentioned to her that I could do this but that since I would be the one paying for the house that I would only be putting my name as a homeowner. I said I don't expect her to pay rent obviously, I'd only expect her to contribute towards utilities and groceries.She said I was being unfair since we were planning to buy a house together. I said that if she wants then I'm happy to wait until we both have the money then or I'm happy to pay the down payment then my gf can pay all of the mortgage until she matches the down payment. She said since I have the money now, it makes sense for us to get a house now since it would mean we're not paying rent anymore.I told her that's fine with me but if we choose the option to buy sooner then I will be the sole homeowner. She again said I was being unfair since it should be both of us but I just pointed out that I'm the one paying for the house.She just repeated that I was being unfair towards her and that we should both be on the deeds as homeowners.How would you handle this?Tl;dr I recently inherited a large sum of money. I mentioned to me gf the possibility of buying a house with it, I said the house would be in my name only. She got annoyed at this so I offered her multiple alternatives which she also turned down. She is saying I'm unfair for not putting her name on the deed."
    },
    {
        "Title": "My MIL (65f) asking for my (34F) wedding ring back twice \"you haven't had kids\"",
        "Body": "My husband (40m) and I (34f) have been married for 9 years. His family has been absolutely horrible for about 7 of those. Everyone is local to our area.Readers digest: MIL (65f) used to be a real estate agent/RE firm manager. She helped my BIL and his affair (while his wife was pregnant with twins) secretly purchase a home, while lying to his wife. BIL then two-timed wife and mistress for 3 years, my MIL enabled and lied in wild ways to help him keep it secret (truly). 6 years ago, MIL was discovered to have committed wire fraud, escrow fraud, and possible embezzlement of $300,000+ from her real estate firm. IRS investigated and could not find evidence enough to charge her criminally for embezzlement, but MIL did lose her RE license permanently (her mom paid off the other crimes/settled outside of court). MIL has since been on the verge of a 3rd bankruptcy while trying to sell life insurance to pay her bills. My FIL (70m) is in terrible health.MIL has told me \"you caused BIL to cheat - when you and husband got married, BIL lost his entire support and best friend\". We sat down and had a conversation with MIL and FIL about this and other issues. It was received but not really improved after.Husband and I did marriage counseling 4 years ago to figure out how to save ourselves from this insanity. Decided to see them 2x a year, basically Easter and Christmas/Thxgiving at most. He's in therapy weekly now and recognizes the toxicity.3 years ago on Christmas, we had MIL, FIL over for Christmas. MIL waited for my husband to leave the room, and asked for my heirloom wedding ring back. Husband overheard, came back in, and MIL stated it was because she \"wanted it to stay in the family with a grandchild, and we hadn't had kids.\" We said absolutely not, that was my ring.This year on Christmas, she asked for it AGAIN. Once again, claiming she wants to give it to our neice (3yo, product of the BIL affair) as we haven't had kids. My husband got angry and shut it down. (We should have just walked out.) MIL stated she wants it to stay in the family, my husband said \"we are family.\"I'm so over it. A pregnancy would be very high-risk for me, so this repeated issue is triggering, hurtful, frustrating. We've thought about fostering/adopting. My in-laws would not see that child as a 'true grandchild' (their issue).When is enough enough? I'm tired of going to even 1 event per year and feeling emotionally abused at the end of it. I'm ready to go no-contact. I don't want to put my husband in a situation where he has to choose because I did. Our marriage is wonderful, but his family is just too much. We have amazing friends and 'chosen family'."
    },
    {
        "Title": "[UPDATE] BF (34m) is upset I (32f) didn't serve him a plate at Christmas dinner",
        "Body": "[Update]Like an absolute dumb ass, I stayed, I cried my eyes out and told him I how I felt and he didn't have anything to say, just that he's sorry and will do better. We were okay for a week, today is our five year anniversary, well would have been, he broke up with me today.I've had to stay home all week with our child because of a parasite and waiting for tests, on Thursday I got sick and still am sick with what feels like a chest cold/infection.The morning of our anniversary he goes rock climbing, I don't know what time he left but was gone until noon, I was pissed and texted him it would have been nice to have help while I rested.I cancel the reservations I made to the restaurant that we met at. When I told him this he ripped up the card he got me, told me he's going to stay elsewhere and we're done. He said I am miserable and just want to be sad and that I make him pay with all the ways my dad failed me. * my father could care less about me and I have daddy issues lol*I don't think I'm being unreasonable for expecting him to spend the whole day or coming back early from climbing. I didn't even get a good morning, happy anniversary text. But it is what it is.Anyways, yall were right, I knew it in my heart but didn't want to believe it. There's no coming back from this but I'm okay ❤️ thank you for letting me vent and for all of your advice !!! It's nice to come back and read all the positive support.[Original post]My (34M) bf is upset with me (32F) because I didn't make his plate and serve it to him during Christmas Where do I go from here? Our 5 year anniversary is a couple weeks from now and we have a 2 year old. I didn't know anything was wrong until we started the 5 hr drive home after spending the holidays with my family. He was quiet pretty much the whole way and snapped at me when I asked why he was following too close behind a vehicle, and also driving fast. As soon as we get home he leaves without a word for a couple hours, gets back and says he went to the mall to buy a couple more gifts and some shoes for himself. I'm annoyed because I have been telling him for weeks to pick out shoes and I will buy them for his upcoming birthday* he's really hard to shop for and picky about his clothes. So I asked him why he bought himself shoes when I wanted to buy him some as a gift. He says in rude tone \" send me 100 then because that's how much they were \"I finally ask him what his problem was and he was upset that I didn't make him a plate. I spent over 4 hours cooking for my whole family, also cooked for xmas eve the day before. I was tired. The holidays are exhausting. I couldn't believe he was upset about that, he seemed annoyed on boxing day because we ordered pizza and I made a plate for my stepfather who uses a cane, I told him to make himself a plate and he just sat there.He also said I barely looked at him during our visit and if I did, I didn't smile or look at him lovingly. Like I said I was tired, my 2 year old was also extra clingy so I felt overstimulated and just tried to be present with my family.Lastly he was mad because I didn't go sledding with him and my family, I stayed back with my sister and baby niece and we watched a rom com. I wanted to relax and have some me time, and he was upset about that, saying I just wanted to go on my phone, which I did, I got to watch tiktoks and just scroll for a bit. Any way, after we got home and had this conversation, I left upset and went to have dinner by myself while he took our child for a walk, as soon as I got home he left again and didn't come back for 4 hours. We have barely spoken and I don't want to be the one to sit down and start this conversation, to coddle him and make him feel better. I'm so sick of this, where do I go from here?"
    },
    {
        "Title": "I, 35M am planning to tell my wife (37f) that I want a divorce at our next couples therapy session. Have I wasted a decade of our lives?",
        "Body": "We have been married for 4 years and have been together for almost a decade. She has a lot of stress from her job and trauma from her family and past relationships but she is happy  with our marriage and I'm miserable.For context, it took me two years of asking for her to agree to go to couples counseling in the first place and we've been in therapy, together and alone, for almost two more years. She knows I'm miserable, she knows I'm depressed, but she has put in so little effort to make any changes that I'm just done. I'm sad all the time and she knows that, but it doesn't seem to make a difference.Our therapist knows about my plan. When I told her she said that she was a little surprised that I had held on so long with nothing changing or improving. Obviously she didn't tell me about their individual sessions but she did say that nothing in any of our sessions, couples or individual, led her to believe that I was making unreasonable requests or ignoring what she wanted.Our love languages are different and I know that, but mine never get addressed. I crave physical touch (not just intimacy) and want her to say kind things about me, the way I do with her all the time. Her languages, quality time and gift giving, have taken precedent and I honestly love buying her things she wants. I have the money and I love seeing her face when she gets something she's had her eye on.With regards to intimacy, I do everything. Literally everything in bed to get both of us off but I get touched so infrequently that I feel there must be something wrong with me.I just... I know this is going to crush her but I can't do this any more. I don't even know what I'm looking for here. To vent? To get some assurance that I'm not a horrible person? I feel like I'm ruining her life and  throwing away a decade of our lives. She also doesn't have the same support net that I do, her family lives in Dallas (and her mom and dad have never been very warm or comforting) which is also making me feel worse about this decision."
    },
    {
        "Title": "I (28F) found out my boyfriend (29M) is planning a surprise proposal for me, and I think it is now cancelled after he met with my father. How do I address this without revealing I already sort of knew?",
        "Body": "So, over the past two months my boyfriend was acting weird and a little sneaky. Around 1 month after, I accidentally found out that my boyfriend had contacted my two best friends to help plan a proposal and already bought a ring. I also found out that he took my mom out for lunch to discuss this with her. My sister also slipped a little and made it more obvious. I knew it was supposed to happen this February but did not know the date.I already know that I did too much detective work and should not have found this out, and this is completely my fault. So last week my friend randomly texts me that she saw my boyfriend at a coffee shop, and he did not recognize her, and she was saying it as a joke, but she casually mentioned that he was with my dad (she does not know the dynamic of the relationship and that they had not met before). I have always mentioned that I would love to have my parents blessing before a proposal etc, and I know many don't agree but it is still common in the South and especially in my family and this is also my personal preference.The same day, I called my boyfriend just for a chat and he sounded a little off, so I asked if he's okay and how his is day going but did not reveal that I knew he met my dad. He said that \"It could be better\" and said work was a little overwhelming and he needs to work harder to get into a better position at work as his job is not very stable etc, and he said that would make it easier if at some point this year, I introduce myself to your dad it would be better etc. Again, he did not know I already knew. He also said that if he was a dad he would want his daughter to be stable and with someone worthy etc.I did not know what to say but 1 am heartbroken. Does this mean the meeting didn't go well? I guessed he did not get my father's blessing, and now I don't know how to feel. 1. I was excited for something that is most likely not going to happen soon anymore (which is my fault). 2. I do not like that this happened, and I cannot discuss it with him or make him feel better. What is the best way to address this?CONTEXT: I come from a well-off family, very educated etc. My boyfriend comes from a poor family, but he is kind, caring, hardworking, reliable and so so loving.TO ADDRESS THE COMMENTS TALKING ABOUT ME NOT INTRODUCING THEM: My boyfriend has met my mother and all my siblings, they have known him for the past two years and love him. My father knew about him, I have talked about him and my father does not live with us. It was never a secret relationship.UPDATE: First of all, I want to say thank you to all those who commented to help out or to provide advice/constructive criticism. It is very easy to make assumptions about people's lives, so thank you for not doing that. After reading through your comments I decided to address this issue with my boyfriend as it would be best for our relationship moving forward. I was very honest and told him that I was very suspicious, and people slipped so I knew that he was planning something and meeting with my family. I thanked him for that and for all the thought and effort he put, and I made it clear I do not know exactly what he planned but I appreciate it. I also told him that after our conversation about my father, I was worried about him and what he believed he needed to be for this to work. Apparently, I was overthinking it. So here is what I found out:1. My boyfriend said that I made it clear that I would like my father's blessing and not necessarily permission.2. My father did not say no, and did not say yes. The conversation steered away from me and more into the financial aspects of life, and responsibility, implying that he has a lot of work to do and a lot of things to achieve to be able to lead a stable life. My boyfriend took that as constructive criticism and did not wait for him to say yes about the proposal. As someone mentioned in the comments he said, these are all things we can work on overtime, together. 3. My boyfriend did see my friend at the coffee shop, and already had a feeling I knew but did not think I would overthink it this much. He said he did not mind because the surprise is more about how he will be proposing and not that he will be. At this point I think he was more excited than I am. Now, what I learned from this is that I need to work on my decision-making skills and communication skills. I decided to overthink things, and to worry about minor things in comparison to how important my relationship is to me. I think what I will do for now is continue supporting my boyfriend and reminding him that he is capable. As for my father, I will have a conversation with him once I get the chance. I think it would be healthy to discuss this with him and set some expectations and boundaries."
    },
    {
        "Title": "Son (m22) threatening to cut off contact with me (m65) over med school tuition ",
        "Body": "I paid all of my son’s expenses to get his under grad degree and he is now interested in medical school. Medical school will cost around $400k all in for living expenses and tuition. He is an excellent student but won’t get any aid since I make too much money. I informed my son that he would need to take out loans for medical school since I am on the verge of retirement. I have around $2m in cash and another $1m in equity in my home so I could do it but would feel pinched. All of my friends who are doctors took out loans for themselves and were able to pay them back quickly. He has threatened to cut off all contact if I don’t pay the costs and it honestly feels like huge entitlement and extortion to me. Thoughts on dealing with this?"
    },
    {
        "Title": "My (29M) boyfriend wants me (28F) to do house wife duties when we both work full time. How do I explain why this isn’t fair?",
        "Body": "We are not engaged yet and no kids, he makes triple what I make in income so he decided he would pay the total rent and I would cover utilities/groceries. We both work full time, he sometimes works some overtime but I still work 40 hours a week. He thinks because he pays all of rent that I have to do all the cleaning in the house including picking up his messes because “it’s your job as a woman to be proud of a clean house”. So when I get home from work or have a day off he expects me to do all the cleaning where when he comes home he can sit and watch tv. I can’t afford to go 50/50 on rent with my current income and he doesn’t want to do income based bills. But I really don’t think it’s fair even if he pays the rent because I feel we both deserve rest time and free time and I’m not a maid. But when I try to bring it up he says “then we can just go 50/50”. I’d have to find a second job to afford that. "
    },
    {
        "Title": "I, 45F have recently discovered my husband 40M may potentially be cheating on me. I need help deciphering the evidence I have discovered.",
        "Body": "I have been married to my husband for over 15 years and just recently, I have uncovered some potential evidence suggesting that he may be involved with infidelity.On a date night, my husband decided to take me to a restaurant that he usually visits, however, it is the first time he's taken me. After the dinner, I decide to make small talk with the waitress. She ends up mistaking me as a friend of my husband's. I correct her and say that I am his wife. She looks startled and glances at my husband questioning him, saying 'your wife doesn't usually look like this.' I am beyond shocked because it could only mean one thing - that she's seen him bring another woman into the restaurant, and that they've been intimate enough to suggest that they are in a relationship.I get angry at him on the way home and he keeps insisting: 'If I was cheating on you I would never bring you to the same restaurant that I've brought my mistresses to.' I needed reassurance and instead, he gets frustrated at me when he should be helping me with this misunderstanding (hopefully it is one).Am I being delusional about this situation?Some background information: my husband and I have not had sex for over a year, which I find unusual. I have never turned him down, therefore I suspect he must be receiving sexual pleasure elsewhere.I never thought my husband was the kind of man to partake in infidelity. He has always been kind and honest to me, however, I am finding more and more evidence to suggest that he may be cheating on me and I'm wondering if I'm being delusional here.Thanks for responses in advance."
    },
    {
        "Title": "My (30F) divorce wasn't final. How can I save my engagement with my fiance (36M)? ",
        "Body": "I (30F) have been with my fiance (35M) for about 2 years. We are very happy and very in love. Last month I had court with my ex husband for child support for our daughter. No big deal, things went smoothly. We didn't and never have had lawyers.Today I called the courthouse to get my divorce date to apply for my marriage license with my fiance, which I thought was three years ago when we first went to court. Apparently it wasn't finalized until LAST MONTH. My fiance is furious with me. I am so upset I didn't realize that the child support had to be finalized in order for our divorce to go through. Apparently we were only legally separated. I have not cheated on my fiance, we've lived together and are happy. He is on the verge of leaving, and the marriage is definitely called off. Im not sure how to save this. It was a mistake and I don't know if he is going to get past it. Any advice is appreciated on how to help us move past this. TIA."
    },
    {
        "Title": "My Dad's (M50) Wife Makes Me (F26) Pretend I'm Not His Daughter",
        "Body": "So, this is a bit of a complicated story, but I’ll keep it as straightforward as possible. I (F26) was around 4-5 when my parents divorced. I grew up with my mom, stepdad, and younger siblings, while my dad (M50) moved to another country, remarried, and we eventually lost contact. Without going into too much detail (it’s a 3-5 business day explanation), it was largely due to his new relationship.Fast forward to recently, I moved to the same country to live with my partner, and I decided to reach out to my dad. We reconnected...but under humiliating conditions. My dad’s wife demands that I’m introduced as a “family friend” to their kids, who don’t know I’m their sister. As you can imagine, visiting is always awkward. I can’t call him “dad” or talk much about myself or my family because my stepmom dislikes hearing about it.This New Year’s, my partner and I were invited over to their house for lunch. It was going okay (aside from my stepmom’s mom ignoring my partner the whole time) until one of their kids loudly announced, “Everyone here is family except OP and her partner.” I felt so embarrassed and excluded, especially knowing that everyone at the table was already aware of my real identity but was told not to acknowledge it.To make it worse, my stepmom chimed in with, “Well, what about the dogs?” and my sibling replied, “Yeah, but I meant only we have this last name.” That stung, especially since I’m the OG born with their last name.This reminded me of a previous gathering where everyone knew me as my father's daughter, but I now realize everyone there likely knew the “secret sibling” situation and had been told not to acknowledge it. Thinking back, it makes me feel delayed embarrassment, like I was the only one not in on this unspoken rule.It’s left me feeling deeply hurt. I love the kids, and they really enjoy seeing me. They’re always asking when I’ll visit again. My stepmom insists I visit more to “keep the kids happy,” and I’m questioning why I should keep sacrificing my dignity for their comfort. I’m debating whether to confront my dad about how excluded I feel or to cut ties altogether. I don’t want to lose all contact with the kids, but I also want to stand up for myself, as this situation has opened up my unhealed abandonment issues.The silver lining here is how supportive my partner has been through all this. Luckily, he is my family here! And soon, we’ll be married and can have our own matching last names too :)"
    },
    {
        "Title": "My friend (M39) wants me (F45) to save him from being homeless and I'm ducking his calls.  ",
        "Body": "."
    },
    {
        "Title": "My (18F) pregnant sister (26F) thinks I was insensitive after I didn't accommodate her chair preferences. Can I get advice, please?",
        "Body": "Throwaway because I don't want this linked back to my main.It was my grandma's birthday last Sunday and my parents hosted it at our house since it's the biggest and can accommodate all of our extended. I have 2 older siblings, my sister (26) and my brother (29) but they're both out of the house now, both of them married, my brother has a little boy who is 2 and my sister is 7 months pregnant.Dad and I got up early at like 5am to help mom with all the setting up and the food prep because there was going to be around 20 people coming over plus kids. We removed the fancy dining room chairs and placed them up in my bedroom because mom was worried about the kids getting stuff on them (happened before and was a mf to clean) and we replaced them with the regular chairs we have for events like this one but we did leave out two of the fancy ones downstairs for my grandpa and grandma since they're both elderly and they would be more comfortable for them.No one batted an eye at this when they came over but my sister had a frown on her face but didn't comment (By the way, it wasn't the first time the set up was like this and no one has a problem with it.)Anyway, by the time my parents and I sat down to eat with everybody at 2pm, we were dead on our feet and I just wanted a nap. After the lunch and clearing up the tables, everyone was scattered around the house, a lot of them were watching the kids outside and I was helping my grandma to the bathroom. When we came back, my sister was sitting in grandma's chair and we she saw us she got up with a huff and commented that we should have kept all the fancy chairs downstairs. I told her why we didn't, but she just rolled her eyes.After a bit I was helping my mom bring out dessert and my sister was sitting on a regular chair and she sighed loudly and asked me to go upstairs and get her one of the fancy ones. I just looked at her and ignored her because by that point I had a headache, I was bone tired and was ready for the whole day to be over. She got up and followed me and told me again and I told her again that it was mom's decision, take it up with her. She didn't want to. My brother who was also helping at that point also told her to drop it because he could see my annoyance. She did NOT like that and told him to stay out of it.After the cake was cut and pieces were making rounds I sat down to eat my piece only to have her take it away and ask me AGAIN, holding it hostage as if I were a kid. I suppressed the urge to smash it in her face and told her that they're in my room, have her husband go get her one and to leave me the fuck alone. If it gets dirtied by the kids then it's on her to explain to mom. She perked up at that but asked ME to go get it since he was eating cake. I was done. I got up, kissed my grandma and grandpa on their cheeks, excused myself from everyone and went up to my room and locked my door.My BIL tried going up after like 15 minutes to get the chair but I turned a deaf ear to his knocking. The next day I got a text asking why I tattled to mom when all she wanted was to be comfortable and I was being insensitive at our grandma's bday. Funny thing is that I didn't tell mom because she had enough on her plate. It was my brother, and my mom had apparently had a talk with her because of it. Even though it happened days ago, I'm still annoyed but I also feel a little guilty and think that I overreacted a bit. "
    },
    {
        "Title": "My (34M) bf is upset with me (32F) because I didn't make his plate and serve it to him during Christmas ",
        "Body": "Where do I go from here? Our 5 year anniversary is a couple weeks from now and we have a 2 year old. I didn't know anything was wrong until we started the 5 hr drive home after spending the holidays with my family. He was quiet pretty much the whole way and snapped at me when I asked why he was following too close behind a vehicle, and also driving fast. As soon as we get home he leaves without a word for a couple hours, gets back and says he went to the mall to buy a couple more gifts and some shoes for himself. I'm annoyed because I have been telling him for weeks to pick out shoes and I will buy them for his upcoming birthday* he's really hard to shop for and picky about his clothes. So I asked him why he bought himself shoes when I wanted to buy him some as a gift. He says in rude tone \" send me 100 then because that's how much they were \"I finally ask him what his problem was and he was upset that I didn't make him a plate. I spent over 4 hours cooking for my whole family, also cooked for xmas eve the day before. I was tired. The holidays are exhausting. I couldn't believe he was upset about that, he seemed annoyed on boxing day because we ordered pizza and I made a plate for my stepfather who uses a cane, I told him to make himself a plate and he just sat there.He also said I barely looked at him during our visit and if I did, I didn't smile or look at him lovingly. Like I said I was tired, my 2 year old was also extra clingy so I felt overstimulated and just tried to be present with my family.Lastly he was mad because I didn't go sledding with him and my family, I stayed back with my sister and baby niece and we watched a rom com. I wanted to relax and have some me time, and he was upset about that, saying I just wanted to go on my phone, which I did, I got to watch tiktoks and just scroll for a bit. Any way, after we got home and had this conversation, I left upset and went to have dinner by myself while he took our child for a walk, as soon as I got home he left again and didn't come back for 4 hours. We have barely spoken and I don't want to be the one to sit down and start this conversation, to coddle him and make him feel better. I'm so sick of this, where do I go from here?"
    },
    {
        "Title": "My 37 F wife sent me 42 M this text message. What should I do with it",
        "Body": "My separated? Wife sent me this text message.We have been together for 12 years and married for 6. Our relationship has been a mess for a few years. Several cases of emotional cheating honestly by both of us over the years. Currently we live in the same house but don't talk, share a bed, or have any real relationship. She loves to silent treatment me when we fight, and I do it right back. Basically a war of who can ignore the other one the longest. You could say we are essentially separated but living in the same house.I knew she was on dating websites and talking to other men. I wasn't ok with it, but wasn't going to beg for her attention.Then this happened. She lied about where she was going on new years, and my step daughter sent me the referenced Snapchat story. Step daughter was Angry! Honestly, the worst part is that my kids know. Here is the text message:I spent new years with someone new, and you obviously seen that snap story that was meant for only Barbara.I don’t know what this message will make you feel like but I wanted to share my feelings,   Just from my perspective. I went to spend new years with the guy I met from online,  it was great, he was nice and polite and never over stepped my boundaries. The entire time, every conversation, every question, every eye to eye glance I was wishing it was you,  I was wishing our glances, and conversation were good again. Wishing you would tell me goodnight stories and have pillow talk and pick my brain, and let me pick yours. 11/ 12 however many years ago it’s been I would’ve never thought we would’ve crashed and burned and hurt so badly. It’s so disappointing to see and feel everything we’ve been since I started my new position ,   That was my personal hardest, and the toughest part of us for me. I’m not asking for second chances, for anything else just really disappointed it wasn’t you I am about to go home, I got this message while golfing with my son. I don't know what to even say to this message. What do y'all think?"
    },
    {
        "Title": "I F33 want to divorce my husband M42 because he wants to spend all sundays at his parents’",
        "Body": "Am I being unreasinable here? How can We fix this ? My husband ‘M42´ and I ´F33´ have been together for 5 years , married for 3, We have 1 child. We are overall doing Ok. But he wants to spend 1 day/week or even sleep at his parents house in his old room . This has been going on from the beginning , at first it was « I am taking advantage of my last months as an unmarried man » then « since you don’t need me now, but I’ll be here if you are pregnant or have a child » and then it was « when the baby’s here I won’t leave » then « once the baby is grown and misses me » and now here we are : we have a toddler who requests their dad all the time. And I miss him too. We both work and the weekend we must run errands and do things. And usually we have some Time to relax and unwind and Watch movies and take a slow breakfast and play with toddler on sundays… but he rushes away to relax elsewhere because he says he needs his time to relax. We always fight about it and I am done fighting. To me it seems like being in our home is a job or is a burden he has to go back to his parents’ to relax from. it seems to me like his real home is with his parents and that I am holding him hostage. I hate even the fact that he wants to go. I am just over having the same fight every week, so I am considering breaking it off. I think my child and I deserve someone who wants to be with us. I have nothing against my inlaws and they are not the ones instigating it. They aren’t even at their house this weekend. He thinks and says I am being tyranical and I already have him 6 days/week. "
    },
    {
        "Title": "My husband M31 is divorcing me F28 4 weeks before our baby is born",
        "Body": "My husband decided a couple days ago that he wants a divorce. I am 36 weeks pregnant. We had everything all lined up to bring the baby home. We have had a rocky relationship with alcoholism that ended up with him in the hospital. We have been sober since January 2024 but the relationship still had problems. He tends to be pretty harsh with me and belittles me and calls me names and thing. I got pregnant unexpectedly in June and, though I didn't really feel ready, he had and I both wanted kids so I kept the pregnancy. Since I've been pregnant he's punched a hole in the wall, taken the car keys from me, called me all kinds of names like calling me lazy for being sick while pregnant. We have tried couples counseling and I am in therapy on my own. I started standing up for myself more and he said that I'm calling him a \"peice of shit\" for the things in the past and it's affecting his mental health. I've never said those words all I've said is that I don't like his behavior and its hurt me.That's why he wants a divorce because I can't move past the things he's done even though they keep happening. I also quit my job when we got married because he said that it didn't pay me enough to be a full time job. I gave my car to my brother because  we didn't need more than one because he worked from home. I only have about $200 dollars to my name and no assets. Luckily, the house we live in is my parents so I can stay here but I can't afford a lawyer or even to pay any bills. He's going to take most of the furniture in the house and the baby things we bought. I'm so scared and I don't know what to do. Part of me feels like this was his plan all along because he's always wanted a child. He says that if I'm \"cordial\" he will do 50/50 custody but if I'm not he will go for full. He's already weaponized my mental health because in my first trimester he told me I had to go on antidepressants or he would tell my OB I'm mentally unstable. He won't talk to me and locks himself in his office. Every time I try to talk to him he says I'm violating his boundaries and that I'm insane. I don't want him at the birth of our child anymore. I also would like to put my last name on our child's birth certificate if possible since I never changed mine. Qwhat do I do now? I can't afford a lawyer. How does 50/50 custody of a newborn even work? I want to breastfeed and now I'll have to quickly find a job after being unemployed for 2 years while he is on company leave for 6 weeks. I haven't told my family yet because I don't know how they are going to react. I don't have any friends to confide in either so I'm feeling really alone. "
    }
]